/**
 * @file brick_game.h
 * @brief Заголовочный файл для основной логики игры "Тетрис".
 *
 * Содержит определения перечислений, структур и прототипов функций,
 * необходимых для управления игрой "Тетрис".
 */

#ifndef BRICK_GAME_H
#define BRICK_GAME_H

#include <stdbool.h>

/**
 * @enum UserAction_t
 * @brief Действия пользователя в игре.
 *
 * Перечисляет возможные действия, которые может выполнить пользователь
 * для управления игрой.
 */
typedef enum {
  Start,     /**< Начать игру (клавиша Enter). */
  Pause,     /**< Поставить игру на паузу (клавиша P). */
  Terminate, /**< Завершить игру (клавиша Q или Esc). */
  Left,      /**< Переместить фигуру влево (стрелка влево). */
  Right,     /**< Переместить фигуру вправо (стрелка вправо). */
  Down,      /**< Ускорить падение фигуры (стрелка вниз). */
  Action     /**< Повернуть фигуру (пробел). */
} UserAction_t;

/**
 * @struct GameInfo_t
 * @brief Информация о текущем состоянии игры.
 *
 * Содержит данные о игровом поле, следующей фигуре, счете,
 * рекорде, уровне и состоянии паузы.
 */
typedef struct {
  int **field;    /**< Игровое поле размером 10x20. */
  int **next;     /**< Следующая фигура размером 4x4. */
  int score;      /**< Текущий счет игрока. */
  int high_score; /**< Максимальный рекорд. */
  int level;      /**< Текущий уровень игры (1-10). */
  int pause; /**< Состояние паузы: 0 (игра), 1 (пауза), 2 (стартовый экран). */
} GameInfo_t;

/**
 * @brief Обрабатывает ввод пользователя.
 *
 * Сохраняет действие пользователя и флаг удержания клавиши
 * для последующей обработки в игровом цикле.
 *
 * @param action Действие пользователя.
 * @param hold Флаг удержания клавиши (true, если клавиша нажата).
 */
void userInput(UserAction_t action, bool hold);

/**
 * @brief Возвращает текущее состояние игры.
 *
 * Формирует структуру с данными о текущем состоянии игрового поля,
 * следующей фигуре, счете, рекорде, уровне и паузе.
 *
 * @return Структура GameInfo_t с текущими данными игры.
 */
GameInfo_t updateCurrentState();

#endif